{
  "company": {
    "name": "North American Stamping Group (NASG)",
    "overview": "A leading manufacturer of metal stampings, welded assemblies, and tooling solutions for the automotive industry.",
    "locations": {
      "US": [
        {
          "code": "TN1",
          "city": "Portland",
          "notes": "Corporate headquarters, manufacturing space of 235,000 sq. ft. Also known as TN1, TNN1, TN North, TN North 1."
        },
        {
          "code": "TN2",
          "city": "Portland",
          "notes": "Luke's primary location. Also known as TN2, TNN2, TN North 2."
        },
        {
          "code": "TN3",
          "city": "Pulaski",
          "notes": "Facility with focus on medium-to-high-volume production. Also known as Tennessee South, Pulaski, TNS, TN South."
        },
        {
          "code": "OH1",
          "city": "Ada",
          "notes": "26,000 sq. ft. facility acquired in 2002. Presses range from 160 to 600 tons, supporting progressive stamping, tandem transfer, resistance welding, robotic MIG welding, and washing. Focused on brake and seating components."
        },
        {
          "code": "OH2",
          "city": "Ridgeville Corners",
          "notes": "Also known as NTA, Tooling & Automation, Automation, Tooling, T&A."
        },
        {
          "code": "OH3",
          "city": "Paulding",
          "notes": "Wire forming and welding-focused facility, 110,000 sq. ft."
        },
        {
          "code": "OH4",
          "city": "Bryan",
          "notes": "Set to close by the end of 2024."
        },
        {
          "code": "MI1",
          "city": "Farmington Hills",
          "notes": "Sales and engineering hub with 3,000 sq. ft. of office space, focused on technical support and market growth for automotive components. Also known as Farmington Hills, Sales."
        },
        {
          "code": "IN1",
          "city": "Muncie",
          "notes": "Also known as Muncie."
        }
      ],
      "Canada": [
        {
          "code": "ON1",
          "city": "Woodstock",
          "notes": "Manufacturing plant specializing in progressive stamping and welding."
        },
        {
          "code": "ON2",
          "city": "Woodstock",
          "notes": "22,000 sq. ft. tech center for stamping tool design. Also known as NTC, Tech Center."
        }
      ],
      "Mexico": [
        {
          "code": "QR1",
          "city": "Querétaro",
          "notes": "245,000 sq. ft. facility with presses up to 2000 tons. Also known as Mex, QR01, MX."
        },
        {
          "code": "QR2",
          "city": "Querétaro",
          "notes": "65,000 sq. ft. facility for welded assemblies and advanced automation. Also known as Mex 2, QR02, MX2."
        }
      ]
    },
    "keyExecutives": [
      {
        "name": "Michael Haugey",
        "role": "CEO & President",
        "notes": "Oversees overall operations and strategy. Direct reports include key executives across technology, finance, operations, and engineering."
      },
      {
        "name": "Rick Marsh",
        "role": "CFO",
        "notes": "Financially driven, responsible for budgeting, reporting directly to the CEO. Direct reports include Justin Briley (Director of ERP Systems), David Hannah (Finance Director), Eric Strong (Director of Accounting), and Luke Pickard (Director of IT)."
      },
      {
        "name": "Justin Briley",
        "role": "Director of ERP Systems",
        "notes": "Manages the organization's ERP systems, reporting to Rick Marsh. Direct reports include Devin Swincher (Business Systems Analyst) and Dana Wade (ERP/EDI Analyst)."
      },
      {
        "name": "David Hannah",
        "role": "Finance Director",
        "notes": "Oversees financial planning and analysis, reporting to Rick Marsh."
      },
      {
        "name": "Eric Strong",
        "role": "Director of Accounting",
        "notes": "Handles accounting operations and compliance, reporting to Rick Marsh."
      },
      {
        "name": "Luke Pickard",
        "role": "Director of IT",
        "notes": "Responsible for IT operations and strategy, reporting to Rick Marsh."
      },
      {
        "name": "Mike Rigsby",
        "role": "VP & CTO",
        "notes": "Oversees technological advancements, reporting directly to the CEO."
      },
      {
        "name": "Joe Niehaus",
        "role": "VP of Business Development",
        "notes": "Drives business growth strategies and customer engagement, reporting to the CEO. Direct reports include Josh Burris (Commodity Sales Manager), Cheryl Norton (Business Development Manager), Francisco Bertheau (Senior Account Manager), George Hartz (Commodity Sales Manager), and Scott Smith (Business Development Manager)."
      },
      {
        "name": "Fernando Rodríguez",
        "role": "VP & General Manager",
        "notes": "Manages general operations across various facilities."
      },
      {
        "name": "Colin Turnbull",
        "role": "VP of Advanced Engineering",
        "notes": "Focused on engineering innovations and technical solutions."
      },
      {
        "name": "Susan Whitney",
        "role": "Administrative Assistant President",
        "notes": "Supports administrative functions and executive operations."
      },
      {
        "name": "Mitch Zemer",
        "role": "Operations Manager",
        "notes": "Leads operational initiatives across locations, reporting to the CEO."
      }
    ]
  }
}